Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalPanelNotVisible Property
 Analytical Panel is not visible in the current view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AnalyticalPanelNotVisible { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalPanelNotVisible As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AnalyticalPanelNotVisible {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace